<?php

return [
    'account-overview' => 'खाता अवलोकन',
    'twofactor-messagebox' => 'जारी रखने के लिए आपके खाते में दो-चरणीय प्रमाणीकरण सक्षम होना चाहिए।',
    'apikey' => 'API कुंजी',
    'sshkey' => 'SSH कुंजी',

    'update-password' => [
        'current' => 'वर्तमान पासवर्ड',
        'new' => 'नया पासवर्ड',
        'requirements' => 'आपका नया पासवर्ड कम से कम 8 वर्णों का होना चाहिए और इस वेबसाइट के लिए अद्वितीय होना चाहिए।',
        'confirm' => 'नए पासवर्ड की पुष्टि करें',
        'update' => 'पासवर्ड अपडेट करें',
    ],

    'update-email' => [
        'isUpdated' => 'आपका प्राथमिक ईमेल अपडेट कर दिया गया है',
        'update' => 'ईमेल अपडेट करें',
        'email' => 'ईमेल',
        'confirm' => 'पासवर्ड की पुष्टि करें',
    ],

    'appearance' => [
        'title' => 'दिखावट',
        'lightDarkMode' => 'लाइट/डार्क मोड',
        'light' => 'लाइट',
        'dark' => 'डार्क',
        'language' => 'पैनल भाषा',
        'panel-sounds' => 'पैनल ध्वनियाँ',
        'on' => 'चालू',
        'off' => 'बंद',
    ],

    'twofactor' => [
        'title' => 'दो-चरणीय प्रमाणीकरण',
        'isEnabled' => 'दो-चरणीय सत्यापन आपके खाते पर सक्षम है।',
        'isDisabled' => 'आपके खाते पर दो-चरणीय सत्यापन सक्षम नहीं है। कॉन्फ़िगर करने के लिए नीचे दिए गए बटन पर क्लिक करें।',
        'disable' => 'दो-चरणीय बंद करें',
        'enable' => 'दो-चरणीय चालू करें',
        
        'disable-dialog' => [
            'password' => 'पासवर्ड',
            'cancel' => 'रद्द करें',
            'must-enter-password' => 'जारी रखने के लिए अपना खाता पासवर्ड दर्ज करें।',
            'disable' => 'बंद करें',
        ],

        'setup-dialog' => [
            'description' => 'अपनी पसंद के दो-चरणीय प्रमाणीकरण ऐप का उपयोग करके ऊपर QR कोड स्कैन करें। फिर, नीचे दिए गए फ़ील्ड में 6-अंकों का कोड दर्ज करें।',
            'account-password' => 'खाता पासवर्ड',
            'qrcode-loading' => 'QR कोड लोड होने की प्रतीक्षा कर रहा है...',
            'enter-6digit-password' => 'जारी रखने के लिए 6-अंकों का कोड और अपना पासवर्ड दर्ज करें।',
            'enable' => 'चालू करें',
            'cancel' => 'रद्द करें',
        ],
    ],

    'apiKey' => [
        'label' => 'विवरण',
        'description' => 'इस API कुंजी का विवरण।',
        'allowedIPs-label' => 'अनुमत IP',
        'allowedIPs-description' => 'किसी भी IP को इस API कुंजी का उपयोग करने की अनुमति देने के लिए खाली छोड़ दें, अन्यथा प्रत्येक IP पता एक नई पंक्ति में प्रदान करें।',
        'createButton' => 'बनाएं',

        'your-keys' => 'आपकी API कुंजी',
        'store-save' => 'आपके द्वारा अनुरोधित API कुंजी नीचे दिखाई गई है। कृपया इसे सुरक्षित स्थान पर रखें, यह दोबारा नहीं दिखाई जाएगी।',
        'close' => 'बंद करें',

        'delete-api-key' => 'API कुंजी हटाएं',
        'delete-key' => 'कुंजी हटाएं',
        'all-requests-invalidated-1' => '',
        'all-requests-invalidated-2' => 'कुंजी का उपयोग करने वाले सभी अनुरोध अमान्य हो जाएंगे।',
        'loading' => 'लोड हो रहा है...',
        'no-key-found' => 'इस खाते के लिए कोई API कुंजी मौजूद नहीं है।',
        'last-used' => 'अंतिम उपयोग',
    ],

    'sshKey' => [
        'loading' => 'लोड हो रहा है...',
        'no-key-found' => 'इस खाते के लिए कोई SSH कुंजी मौजूद नहीं है।',
        'added-on' => 'जोड़ा गया',

        'createForm' => [
            'key-name' => 'SSH कुंजी नाम',
            'public-key' => 'सार्वजनिक कुंजी',
            'public-key-desc' => 'अपनी सार्वजनिक SSH कुंजी दर्ज करें।',
            'save' => 'सहेजें',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'SSH कुंजी हटाएं',
            'delete-key' => 'कुंजी हटाएं',
            'will-invalidate-1' => '',
            'will-invalidate-2' => 'SSH कुंजी हटाने से पैनल में इसका उपयोग अमान्य हो जाएगा।',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'दो-चरणीय प्रमाणीकरण सक्षम',
        'description' => 'नीचे दिए गए कोड को सुरक्षित स्थान पर रखें। यदि आप अपने फोन तक पहुंच खो देते हैं तो आप साइन इन करने के लिए इन बैकअप कोड का उपयोग कर सकते हैं।',
        'alert' => 'ये कोड दोबारा नहीं दिखाए जाएंगे।',
        'doneButton' => 'हो गया',
    ],
    'profile' => [
        'update-profile' => 'प्रोफ़ाइल अपडेट करें',
        'first-name' => 'पहला नाम',
        'last-name' => 'अंतिम नाम',
        'username' => 'उपयोगकर्ता नाम',
        'updated-success' => 'आपकी प्रोफ़ाइल अपडेट कर दी गई है।',
    ],
];
