<?php
return [
    'title' => 'बैकअप',
    'create' => 'बैकअप बनाएं',
    'restore' => 'पुनर्स्थापित करें',
    'delete' => 'बैकअप हटाएं',
    'download' => 'बैकअप डाउनलोड करें',
    'name' => 'नाम',
    'size' => 'आकार',
    'date' => 'तारीख',
    'locked' => 'लॉक किया गया',
    'unlocked' => 'अनलॉक',
    'no-backups' => 'कोई बैकअप नहीं।',
    'creating' => 'बैकअप बनाया जा रहा है...',
    'restoring' => 'बैकअप पुनर्स्थापित किया जा रहा है...',
    'failed' => 'बैकअप विफल',
    'completed' => 'बैकअप पूर्ण',
];
